function binar(item, arr) {
    let hight = arr.length //6
    let low = 0 //0

    let i = 0

    while (low <= hight) {  //1)0 <= 6 ,2)0 <= 2, 3)!!!2 <= 2 цикл ще проходть бо умова true
        let mid = Math.floor((low + hight) / 2)//1)3 ,2)1 ,3)2
        let guess = arr[mid]  //1)40 ,2)20 ,30
        if (guess == item) {
            return mid        //1)--,2)-- 3)!!!умова true функція вертає значення
        }
        if (guess > item) {
            hight = mid - 1 //1)high = 2 ,2)--
        }
        else {
            low = mid + 1 // 2)low = 2
        }
        i++
        console.log(i)
    }
    return - 1
}
//під час циклу , при кожній ітерації guess і mid постійно змінюються

console.log(binar(49, [
    0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
    12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
    24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
    36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
    48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
    60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
    72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83,
    84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95,
    96, 97, 98, 99,100
]))